# Income Tax

Income tax is a tax levied on the income earned by individuals and businesses. It is one of the primary sources of revenue for the UK government and is used to fund public services and government expenditures.

- Tax Allowances:
These are specific amounts of income that individuals can earn before they are required to pay income tax. Various types of allowances exist, such as Personal Allowance, Marriage Allowance, Property Allowance, and Dividend Allowance, each offering different benefits and eligibility criteria.

- Tax Charges:
Tax charges arise when an individual's income exceeds certain thresholds or when specific conditions are met. These liabilities ensure that individuals contribute a fair amount to the national revenue, with the charges varying depending on the level of income and other factors like the High-Income Child Benefit Charge.

- Tax Rates:
The government applies different percentages of tax rates based on the income bracket an individual falls into. There are Basic, Higher, and Additional rates, each applicable to respective income ranges. Moreover, specific types of income, like dividends, have their distinct tax rates.

- Tax Reliefs:
To promote certain behaviors or ease the tax burden for specific groups, the government provides tax reliefs. These provisions reduce tax liability for eligible individuals, with examples including reliefs for Pension Contributions, Charitable Donations, and Work-Related Expenses.

## Legislation

UK income tax legislation is grounded in primary legislation passed by the UK Parliament, supplemented by secondary legislation and administrative guidance issued by Her Majesty's Revenue and Customs (HMRC).

- Income Tax Act 2007 (ITA 2007):
This is a central piece of legislation consolidating various statutes related to income tax in the UK. It comprehensively covers aspects such as the charge to tax, applicable rates, allowances, and reliefs, serving as a foundational reference for income tax matters.

- Taxation of Chargeable Gains Act 1992 (TCGA 1992):
Though primarily focused on capital gains tax, this Act intersects significantly with income tax, particularly in the realm of taxation of gains. It provides detailed regulations on how gains should be taxed and calculated.

- Income Tax (Earnings and Pensions) Act 2003 (ITEPA 2003):
ITEPA 2003 governs the rules related to the taxation of employment income, pension income, and social security income. It outlines the various categories and criteria for taxable earnings and pensions, ensuring a structured approach to taxation in these areas.

- HMRC Manuals and Guidance:
Produced by HMRC, these comprehensive guides aim to help taxpayers in understanding and complying with the complex tax legislation. They provide practical insights and interpretations of the laws, offering clarity and assistance to both individuals and businesses in navigating the income tax landscape.

## Methodology:

 Income tax logic can be found in policyengine-uk/policyengine_uk/variables/gov/hmrc/income_tax.

The following table shows a series of income tax simulations using the PolicyEngine UK model.

In [10]:
import pandas as pd

from policyengine_uk import Simulation

def calculate_income_tax(employment_income, dividend_income):
    simulation = Simulation(
        situation={
            "people": {
                "person": {
                    "employment_income": employment_income,
                    "dividend_income": dividend_income,
                }
            }
        }
    )
    return simulation.calculate("income_tax")[0] 

data = {
    "Person": ["Person 1", "Person 2", "Person 3", "Person 4", "Person 5"],
    "Employment Income (£)": [50000, 60000, 70000, 80000, 90000],
    "Dividend Income (£)": [10000, 15000, 20000, 25000, 30000],
    "Income Tax (£)": []
}

for emp_income, div_income in zip(data["Employment Income (£)"], data["Dividend Income (£)"]):
    data["Income Tax (£)"].append(calculate_income_tax(emp_income, div_income))

df = pd.DataFrame(data)
df

     Person  Employment Income (£)  Dividend Income (£)  Income Tax (£)
0  Person 1                  50000                10000         10068.5
1  Person 2                  60000                15000         15657.0
2  Person 3                  70000                20000         21282.0
3  Person 4                  80000                25000         27907.0
4  Person 5                  90000                30000         36532.0

## Appendix:

The following tables display the parameter values for income tax allowance.

- Annual Allowance:

In [17]:
annual_allowance_data = [
    {
        "Name": "default",
        "Value": "2015-06-01: 40,000",
        "Unit": "currency-GBP"
    },

    {
        "Name": "minimum",
        "Value": "2015-06-01: 4,000",
        "Unit": "currency-GBP"
    },

    {
        "Name": "reduction_rate",
        "Value": "2015-06-01: 0.5",
        "Unit": "marginal-rate"

    },
    {
        "Name": "taper",
        "Value": "2015-06-01: 240,000",
        "Unit": "currency-GBP"
    }
]

df = pd.DataFrame(annual_allowance_data)
df

             Name                Value           Unit
0         default   2015-06-01: 40,000   currency-GBP
1         minimum    2015-06-01: 4,000   currency-GBP
2  reduction_rate      2015-06-01: 0.5  marginal-rate
3           taper  2015-06-01: 240,000   currency-GBP

- Marriage Allowance

In [20]:
marriage_allowance_data = [
    {
        "Name": "max",
        "Value": "2016-04-01: 0.1",
        "Unit": "/1"
    },
    {
        "Name": "rounding_increment",
        "Value": "2016-04-01: 10",
        "Unit": "currency-GBP"
    },
    {
        "Name": "takeup_rate",
        "Value": "2000-01-01: 1",
        "Unit": "/1"
    }
]

df = pd.DataFrame(marriage_allowance_data)
df

                 Name            Value          Unit
0                 max  2016-04-01: 0.1            /1
1  rounding_increment   2016-04-01: 10  currency-GBP
2         takeup_rate    2000-01-01: 1            /1

- Married Couple's Allowance:

In [25]:
married_couples_allowance_data = [
    {
        "Name": "deduction_rate",
        "Value": "2010-01-01: 10%",
        "Unit": "/1"
    }
]

df = pd.DataFrame(married_couples_allowance_data)
df

             Name            Value Unit
0  deduction_rate  2010-01-01: 10%   /1

- Personal Allowance:

In [28]:
dates = ['2015-04-06', '2017-04-06', '2018-04-06', '2019-04-06', '2021-04-06', '2025-04-06']
values = [10600, 11500, 11850, 12500, 12570, 12570]

df = pd.DataFrame({
    'Date': dates,
    'Allowance Amount': values,
    'Unit': "currency-GBP"
})

df

         Date  Allowance Amount          Unit
0  2015-04-06             10600  currency-GBP
1  2017-04-06             11500  currency-GBP
2  2018-04-06             11850  currency-GBP
3  2019-04-06             12500  currency-GBP
4  2021-04-06             12570  currency-GBP
5  2025-04-06             12570  currency-GBP

- Personal Savings Allowance:

In [29]:
personal_savings_allowance_data = [
    {
        "Name": "additional threshold",
        "Value": "2005-06-01: 0",
        "Unit": "currency-GBP"
    },
    {
        "Name": "basic threshold",
        "Value": "2005-06-01: 1,000",
        "Unit": "currency-GBP"
    },
    {
        "Name": "higher threshold",
        "Value": "2005-06-01: 500",
        "Unit": "currency-GBP"
    }
]

df = pd.DataFrame(personal_savings_allowance_data)
df

                   Name              Value          Unit
0  additional threshold      2005-06-01: 0  currency-GBP
1       basic threshold  2005-06-01: 1,000  currency-GBP
2      higher threshold    2005-06-01: 500  currency-GBP

- Dividend Allowance:

In [30]:
dividend_allowance_data = [
    {
        "Name": "dividend_allowance",
        "Value": "2015-06-05: 2,000",
        "Unit": "currency-GBP"
    }
]

df = pd.DataFrame(dividend_allowance_data)
df

                 Name              Value          Unit
0  dividend_allowance  2015-06-05: 2,000  currency-GBP

- Property Allowance:

In [31]:
property_allowance_data = [
    {
        "Name": "property_allowance",
        "Value": "2005-06-01: 1,000",
        "Unit": "currency-GBP"
    }
]

df = pd.DataFrame(property_allowance_data)
df

                 Name              Value          Unit
0  property_allowance  2005-06-01: 1,000  currency-GBP

- Trading Allowance:

In [33]:
trading_allowance_data = [
    {
        "Name": "trading_allowance",
        "Value": "2005-06-01: 1,000",
        "Unit": "currency-GBP"
    }
]

df = pd.DataFrame(trading_allowance_data)
df

                Name              Value          Unit
0  trading_allowance  2005-06-01: 1,000  currency-GBP

Other income tax parameters can be found in policyengine-uk/policyengine_uk/parameters/gov/hmrc/income_tax.